### **(1) 데이터프레임 기본 조회**

In [ ]:
import pandas as pd

2) read_csv()로 DataFrame 생성

- 파일 경로: https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic_simple.csv

**[titanic_simple 데이터 셋 정보]**

- PassengerId : 승객번호
- Survived : 생존여부(1:생존, 0:사망)
- Pclass : 객실등급(1:1등급, 2:2등급, 3:3등급)
- Name : 승객이름
- Sex : 성별(male, female)
- Age : 나이
- Fare : 운임($)
- Embarked : 승선지역(Southhampton, Cherbourg, Queenstown)

In [ ]:
file_dir = "https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic_simple.csv"
titanic = pd.read_csv(file_dir)

3) head(): 맨 위 행 데이터 확인

In [4]:
# 상위 10행 출력
print(titanic.head(10))
# 또는 print(titanic.head(10))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3
5            6         0       3
6            7         0       1
7            8         0       3
8            9         1       3
9           10         1       2

                                                Name     Sex   Age     Fare  \
0                            Braund, Mr. Owen Harris    male  22.0   7.2500
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0  71.2833
2                             Heikkinen, Miss. Laina  female  26.0   7.9250
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0  53.1000
4                           Allen, Mr. William Henry    male  35.0   8.0500
5                                   Moran, Mr. James    male   NaN   8.4583
6                            McCarthy, Mr. Timothy J    male  54.0  51.8625
7                     Palsson, Master. Gosta Leonard    male   2.0  21.0750
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0  11.1333
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0  30.0708

      Embarked
0  Southampton
1    Cherbourg
2  Southampton
3  Southampton
4  Southampton
5   Queenstown
6  Southampton
7  Southampton
8  Southampton
9    Cherbourg

4) shape: 행, 열 개수 확인

In [5]:
# 크기 확인
print(titanic.shape)

(891, 8)

5) dtype: 열 dtype 확인

In [6]:
# 열 데이터 형식 확인
print(titanic.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
Fare           float64
Embarked        object
dtype: object

6) info(): 열 값, 개수, 데이터타입 확인

In [7]:
# 열 정보 확인
print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   Fare         891 non-null    float64
 7   Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 55.8+ KB
None

7) value_counts(): 열 별 고유값, 개수

In [8]:
print(titanic.value_counts(["Embarked", "Pclass"]))

Embarked     Pclass
Southampton  3         353
             2         164
             1         127
Cherbourg    1          85
Queenstown   3          72
Cherbourg    3          66
             2          17
Queenstown   2           3
             1           2
Name: count, dtype: int64

8) ex) Age, Fare 최댓값 확인

In [30]:
print(titanic[["Age", "Fare"]].max())

Age      80.0000
Fare    512.3292
dtype: float64

9) ex) Fare 열 기준 내림차순 정렬 조회

In [10]:
titanic.sort_values(by="Fare", ascending=False).head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,512.3292,Cherbourg
258,259,1,1,"Ward, Miss. Anna",female,35.0,512.3292,Cherbourg
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,512.3292,Cherbourg
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,263.0000,Southampton
438,439,0,1,"Fortune, Mr. Mark",male,64.0,263.0000,Southampton
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,263.0000,Southampton
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,263.0000,Southampton
742,743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,262.3750,Cherbourg
311,312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,262.3750,Cherbourg
299,300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,247.5208,Cherbourg

### **(2) 데이터프레임 조건 조회**

1. 특정 열 조회

In [13]:
titanic[["Name"]]

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
886                              Montvila, Rev. Juozas
887                       Graham, Miss. Margaret Edith
888           Johnston, Miss. Catherine Helen "Carrie"
889                              Behr, Mr. Karl Howell
890                                Dooley, Mr. Patrick

[891 rows x 1 columns]

2. 복수 열 조회

In [12]:
titanic[["Name", "Age", "Sex"]]

                                                  Name   Age     Sex
0                              Braund, Mr. Owen Harris  22.0    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                               Heikkinen, Miss. Laina  26.0  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                             Allen, Mr. William Henry  35.0    male
..                                                 ...   ...     ...
886                              Montvila, Rev. Juozas  27.0    male
887                       Graham, Miss. Margaret Edith  19.0  female
888           Johnston, Miss. Catherine Helen "Carrie"   NaN  female
889                              Behr, Mr. Karl Howell  26.0    male
890                                Dooley, Mr. Patrick  32.0    male

[891 rows x 3 columns]

3. 복수 열의 맨 위 행들 조회

In [14]:
titanic[["Name", "Age", "Sex"]].head(10)

                                                Name   Age     Sex
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                             Heikkinen, Miss. Laina  26.0  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                           Allen, Mr. William Henry  35.0    male
5                                   Moran, Mr. James   NaN    male
6                            McCarthy, Mr. Timothy J  54.0    male
7                     Palsson, Master. Gosta Leonard   2.0    male
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0  female
9                Nasser, Mrs. Nicholas (Adele Achem)  14.0  female

4. 나이가 70세 이상인 행 확인

In [15]:
is_older_than_70 = titanic["Age"] >= 70
titanic[is_older_than_70]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,34.6542,Cherbourg
116,117,0,3,"Connors, Mr. Patrick",male,70.5,7.7500,Queenstown
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,49.5042,Cherbourg
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,30.0000,Southampton
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,10.5000,Southampton
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,71.0000,Southampton
851,852,0,3,"Svensson, Mr. Johan",male,74.0,7.7750,Southampton

5. Fare 평균

In [ ]:
Fare_mean = titanic["Fare"].mean()
print(f"Fare(운임)의 평균: {Fare_mean}")

32.204207968574636

6. Fare의 평균보다 값이 작은 행 조회

In [17]:
has_paid_less = titanic["Fare"] < Fare_mean
print(titanic[has_paid_less])

     PassengerId  Survived  Pclass                                      Name  \
0              1         0       3                   Braund, Mr. Owen Harris
2              3         1       3                    Heikkinen, Miss. Laina
4              5         0       3                  Allen, Mr. William Henry
5              6         0       3                          Moran, Mr. James
7              8         0       3            Palsson, Master. Gosta Leonard
..           ...       ...     ...                                       ...
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age     Fare     Embarked
0      male  22.0   7.2500  Southampton
2    female  26.0   7.9250  Southampton
4      male  35.0   8.0500  Southampton
5      male   NaN   8.4583   Queenstown
7      male   2.0  21.0750  Southampton
..      ...   ...      ...          ...
886    male  27.0  13.0000  Southampton
887  female  19.0  30.0000  Southampton
888  female   NaN  23.4500  Southampton
889    male  26.0  30.0000    Cherbourg
890    male  32.0   7.7500   Queenstown

[680 rows x 8 columns]

7. 승선지역(Embarked)이 'Southhampton', 'Queenstown' 인 승객

In [ ]:
# 데이터 확인 결과, Southhampton에서 승선한 승객은 없음
em_Sh = titanic["Embarked"] == 'Southhampton'
em_Qt = titanic["Embarked"] == 'Queenstown'
print(titanic[em_Sh | em_Qt])

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, Fare, Embarked]
Index: []

8. 나이(Age)가 10대(10이상, 20 미만)인 남자 청소년의 평균 운임(Fare)

In [27]:
is_teen1 = titanic["Age"] >= 10
is_teen2 = titanic["Age"] < 20
print(titanic[is_teen1 & is_teen2])

     PassengerId  Survived  Pclass                                  Name  \
9             10         1       2   Nasser, Mrs. Nicholas (Adele Achem)
14            15         0       3  Vestrom, Miss. Hulda Amanda Adolfina
22            23         1       3           McGowan, Miss. Anna "Annie"
27            28         0       1        Fortune, Mr. Charles Alexander
38            39         0       3    Vander Planke, Miss. Augusta Maria
..           ...       ...     ...                                   ...
853          854         1       1             Lines, Miss. Mary Conover
855          856         1       3            Aks, Mrs. Sam (Leah Rosen)
875          876         1       3      Najib, Miss. Adele Kiamie "Jane"
877          878         0       3                  Petroff, Mr. Nedelio
887          888         1       1          Graham, Miss. Margaret Edith

        Sex   Age      Fare    Embarked
9    female  14.0   30.0708  Queenstown
14   female  14.0    7.8542  Queenstown
22   female  15.0    8.0292  Queenstown
27     male  19.0  263.0000  Queenstown
38   female  18.0   18.0000  Queenstown
..      ...   ...       ...         ...
853  female  16.0   39.4000  Queenstown
855  female  18.0    9.3500  Queenstown
875  female  15.0    7.2250  Queenstown
877    male  19.0    7.8958  Queenstown
887  female  19.0   30.0000  Queenstown

[102 rows x 8 columns]